#include <stdio.h>
#include <math.h>
#include <locale.h>
int main()
{
    zadanie1();
}
int zadanie1()
{
    setlocale(LC_ALL, "RUS");

    double x1, y1, r1, x2, y2, r2, d;

    // ввод данных
    printf("Введите координаты центра первой окружности: ");
    scanf("%lf %lf", &x1, &y1);
    printf("Введите радиус первой окружности: ");
    scanf("%lf", &r1);
    printf("Введите координаты центра второй окружности: ");
    scanf("%lf %lf", &x2, &y2);
    printf("Введите радиус второй окружности: ");
    scanf("%lf", &r2);
    d = sqrt((x2 - x1) * (x2 - x1) + (y2 - y1) * (y2 - y1)); // расстояние между центрами окружностей

    if (d <= r1 + r2 && d >= fabs(r1 - r2))                // первое выражение проверяет далеко ли находится одна окружность от другой, 
        //второе - находится ли одна окружность внутри другой
        printf("Окружности пересекаются\n");
    else
        printf("Окружности не пересекаются\n");

    return 0;
}
int zadanie2()
{
    setlocale(LC_ALL, "RUS");
    double x, y;
    printf("Введите координату x: ");
    scanf("%lf", &x);
    printf("Введите координату y: ");
    scanf("%lf", &y);
    if (y <= 0 && y >= 1.5 * x - 6 && y >= -1.5 * x - 6)
    {
        printf("Точка (%.2f;%.2f) принадлежит заштрихованной области \n", x, y);
    }
    else {
        printf("Точка (%.2f;%.2f) НЕ принадлежит заштрихованной области \n", x, y);
    }
    return 1;
}